practice_026_leetcode_weekly_contest_304.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practice #026: Leetcode Weekly Contest 304</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">
</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Practice #026: Leetcode Weekly Contest 304</h1>

<div id="outline-container-org0fd9864" class="outline-2">
<h2 id="org0fd9864">Leetcode: 2357. Make Array Zero by Subtracting Equal Amounts</h2>
<div class="outline-text-2" id="text-org0fd9864">
<p>
<a href="https://leetcode.com/problems/make-array-zero-by-subtracting-equal-amounts/">Problem Statement</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minimumOperations</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">set</span>(nums) - <span style="font-weight: bold;">set</span>([0]))


<span style="font-weight: bold;">assert</span> Solution().minimumOperations([1, 5, 0, 3, 5]) == 3
<span style="font-weight: bold;">assert</span> Solution().minimumOperations([0]) == 0
</pre>
</div>
</div>
</div>

<div id="outline-container-org82c26c6" class="outline-2">
<h2 id="org82c26c6">Leetcode: 2358. Maximum Number of Groups Entering a Competition</h2>
<div class="outline-text-2" id="text-org82c26c6">
<p>
<a href="https://leetcode.com/problems/maximum-number-of-groups-entering-a-competition/">Problem Statement</a>
</p>

<ul class="org-ul">
<li>I saw that the numbers didn't matter, but decided to code the simulation anyways.  It turned out that the code is simpler if we discard the input.</li>
</ul>

<p>
Linear solution:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">maximumGroups</span>(<span style="font-weight: bold;">self</span>, grades: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(grades)
        <span style="font-weight: bold; font-style: italic;">ac</span> = 0
        <span style="font-weight: bold;">for</span> k <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, N + 1):
            <span style="font-weight: bold;">if</span> ac + k &gt; N:
                <span style="font-weight: bold;">return</span> k - 1
            <span style="font-weight: bold;">if</span> ac + k == N:
                <span style="font-weight: bold;">return</span> k
            ac += k
            k += 1

        <span style="font-weight: bold;">return</span> k


<span style="font-weight: bold;">assert</span> Solution().maximumGroups([10, 6, 12, 7, 3, 5]) == 3
<span style="font-weight: bold;">assert</span> Solution().maximumGroups([8, 8]) == 1
</pre>
</div>

<p>
<a href="binary_search.html#ID-1217FC3D-A9F9-49EC-BA5D-A68E50338DBD">Binary Search</a> solution:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">maximumGroups</span>(<span style="font-weight: bold;">self</span>, grades: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(grades)
        <span style="font-weight: bold; font-style: italic;">s</span> = 1
        <span style="font-weight: bold; font-style: italic;">e</span> = N
        <span style="font-weight: bold;">while</span> s &lt;= <span style="font-weight: bold; font-style: italic;">e</span>:
            m = s + (e - s) // 2
            <span style="font-weight: bold; font-style: italic;">c</span> = (m * (m + 1)) // 2
            <span style="font-weight: bold;">if</span> c == N:
                <span style="font-weight: bold;">return</span> m
            <span style="font-weight: bold;">elif</span> c &lt; N:
                s = m + 1
            <span style="font-weight: bold;">else</span>:
                e = m - 1
        <span style="font-weight: bold;">return</span> s - 1


<span style="font-weight: bold;">assert</span> Solution().maximumGroups([10, 6, 12, 7, 3, 5]) == 3
<span style="font-weight: bold;">assert</span> Solution().maximumGroups([8, 8]) == 1
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b48f61" class="outline-2">
<h2 id="org8b48f61">Leetcode: 2359. Find Closest Node to Given Two Nodes</h2>
<div class="outline-text-2" id="text-org8b48f61">
<p>
<a href="https://leetcode.com/problems/find-closest-node-to-given-two-nodes/">Problem Statement</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">closestMeetingNode</span>(<span style="font-weight: bold;">self</span>, edges: List[<span style="font-weight: bold;">int</span>], node1: <span style="font-weight: bold;">int</span>, node2: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(edges)

        <span style="font-weight: bold; font-style: italic;">d1</span> = [<span style="font-weight: bold; text-decoration: underline;">None</span>] * N
        <span style="font-weight: bold; font-style: italic;">d1</span>[<span style="font-weight: bold; font-style: italic;">node1</span>] = 0
        <span style="font-weight: bold; font-style: italic;">u</span> = node1
        <span style="font-weight: bold;">while</span> edges[u] != -1 <span style="font-weight: bold;">and</span> d1[edges[u]] <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            d1[<span style="font-weight: bold; font-style: italic;">edges</span>[u]] = d1[u] + 1
            <span style="font-weight: bold; font-style: italic;">u</span> = edges[u]

        <span style="font-weight: bold; font-style: italic;">d2</span> = [<span style="font-weight: bold; text-decoration: underline;">None</span>] * N
        <span style="font-weight: bold; font-style: italic;">d2</span>[<span style="font-weight: bold; font-style: italic;">node2</span>] = 0
        <span style="font-weight: bold; font-style: italic;">u</span> = node2
        <span style="font-weight: bold;">while</span> edges[u] != -1 <span style="font-weight: bold;">and</span> d2[edges[u]] <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            d2[<span style="font-weight: bold; font-style: italic;">edges</span>[u]] = d2[u] + 1
            <span style="font-weight: bold; font-style: italic;">u</span> = edges[u]

        <span style="font-weight: bold; font-style: italic;">ans</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>
        <span style="font-weight: bold;">for</span> i, a, b <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">zip</span>(<span style="font-weight: bold;">range</span>(N), d1, d2):
            <span style="font-weight: bold;">if</span> a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> b <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
                <span style="font-weight: bold;">continue</span>
            <span style="font-weight: bold;">if</span> ans <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> <span style="font-weight: bold;">max</span>(d1[ans], d2[ans]) &gt; <span style="font-weight: bold;">max</span>(a, b):
                <span style="font-weight: bold; font-style: italic;">ans</span> = i
        <span style="font-weight: bold;">return</span> -1 <span style="font-weight: bold;">if</span> ans <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">else</span> ans


<span style="font-weight: bold;">assert</span> Solution().closestMeetingNode([2, 2, 3, -1], 0, 1) == 2
<span style="font-weight: bold;">assert</span> Solution().closestMeetingNode([1, 2, -1], 0, 2) == 2
</pre>
</div>
</div>
</div>

<div id="outline-container-org55274b0" class="outline-2">
<h2 id="org55274b0">Leetcode: 2360. Longest Cycle in a Graph</h2>
<div class="outline-text-2" id="text-org55274b0">
<p>
<a href="https://leetcode.com/problems/longest-cycle-in-a-graph/">Problem Statement</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">longestCycle</span>(<span style="font-weight: bold;">self</span>, edges: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(edges)

        <span style="font-weight: bold; font-style: italic;">in_cnt</span> = [0] * N
        <span style="font-weight: bold;">for</span> u, v <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(edges):
            <span style="font-weight: bold;">if</span> v == -1:
                <span style="font-weight: bold;">continue</span>
            in_cnt[<span style="font-weight: bold; font-style: italic;">v</span>] += 1

        prunes = [u <span style="font-weight: bold;">for</span> u <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N) <span style="font-weight: bold;">if</span> in_cnt[u] == 0]
        vis = [<span style="font-weight: bold; text-decoration: underline;">False</span>] * N
        <span style="font-weight: bold;">for</span> u <span style="font-weight: bold;">in</span> prunes:
            vis[u] = <span style="font-weight: bold; text-decoration: underline;">True</span>
            v = edges[u]
            <span style="font-weight: bold;">if</span> v == -1:
                <span style="font-weight: bold;">continue</span>
            in_cnt[v] -= 1
            <span style="font-weight: bold;">if</span> in_cnt[v] == 0:
                prunes.append(v)

        ans = -1
        <span style="font-weight: bold;">for</span> u <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            cnt = 0
            <span style="font-weight: bold;">while</span> <span style="font-weight: bold;">not</span> vis[u]:
                vis[u] = <span style="font-weight: bold; text-decoration: underline;">True</span>
                u = edges[u]
                cnt += 1
                ans = <span style="font-weight: bold;">max</span>(ans, cnt)
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().longestCycle([3, 3, 4, 2, 3]) == 3
<span style="font-weight: bold;">assert</span> Solution().longestCycle([2, -1, 3, 1]) == -1
</pre>
</div>
</div>
</div>
</div>
</body>
</html>